/*
此文件为配置文件，主要包含主程序中所使用的一些宏定义参数
*/

//--------------------------------------------//
//------------------模型相关------------------//
#define SHIFT 3  //数值由这个决定（inf.quantBits - pOM->fracBits - 1）

//--------------------------------------------//
//------------------舵机相关------------------//
#define left_rudder_edge 3900   //舵机左打角极限值
#define middle_rudder 3550   //舵机中值
#define right_rudder_edge 3200   //舵机右打角极限值

//--------------------------------------------//
//------------------电机相关------------------//
#define motor_pwm_max 49000
#define motor_pwm_min -30000

//--------------------------------------------//
//------------------电感相关------------------//
#define AdcNum 15  //电感数量
#define SampleNum 50  //电感采集样本量



//定义全局变量

